docs/fxg.txt

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.webservices.services.adapter.datahub/"><soapenv:Header/><soapenv:Body><ws:putSalesOrderData><wmsSecurityInfo><username>FLUXBGY</username><password>8888</password></wmsSecurityInfo><soInfo><wmsResultInfo><resultInfo/><returnCode/><returnDesc/><returnFlag/></wmsResultInfo><wmsSOHeaders><WAREHOUSEID>01</WAREHOUSEID><SALESORDERNO>BGYSDLR2020093000016770</SALESORDERNO><ORDERTYPE>XXSC</ORDERTYPE><ORDERTIME>2020-09-30 11:19:21</ORDERTIME><REQUIREDDELIVERYTIME>2020-10-01 00:00:00</REQUIREDDELIVERYTIME><EXPECTEDSHIPMENTTIME1>2020-10-01 00:00:00</EXPECTEDSHIPMENTTIME1><CUSTOMERID>FXG</CUSTOMERID><SOREFERENCE1>BGYSDLR2020093000016770</SOREFERENCE1><CONSIGNEEID>0506</CONSIGNEEID><CONSIGNEENAME>东莞莞城区旗峰路店</CONSIGNEENAME><c_Address1>东莞莞城区旗峰路52号商铺</c_Address1><c_Contact>0769-82199620</c_Contact><SOREFERENCE4>CW</SOREFERENCE4><detailsItem><SALESORDERNO>BGYSDLR2020093000016770</SALESORDERNO><USERDEFINE5>BGYSDLR2020093000016770</USERDEFINE5><d_EDI_16>21548</d_EDI_16><CUSTOMERID>FXG</CUSTOMERID><SKU>564759</SKU><LOTATT06>szggk</LOTATT06><d_EDI_07>szggk</d_EDI_07><UOM>EA</UOM><d_EDI_15>块</d_EDI_15><d_EDI_06> </d_EDI_06><QTYORDERED_EACH>1.000000</QTYORDERED_EACH></detailsItem></wmsSOHeaders></soInfo><wmsParam><customerid>FLUXWS</customerid><messageid>106SO</messageid><stdno>106SO</stdno><warehouseid>WH01</warehouseid></wmsParam></ws:putSalesOrderData></soapenv:Body></soapenv:Envelope>
